Revit 2027 API
AreaBasedLoadBoundaryLineData.GetLevelIdsInRange Method
 Returns level ids between the top level and the bottom level (including the top level and the bottom level) of the area based load boundary line.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetLevelIdsInRange()
Public Function GetLevelIdsInRange As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetLevelIdsInRange()
member GetLevelIdsInRange : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The level ids between the top level and the bottom level (including the top level and the bottom level).
See Also
Reference
AreaBasedLoadBoundaryLineData Class
Autodesk.Revit.DB.Electrical Namespace